In [1]:
import pandas as pd

In [2]:
data = [[9, 'Hercy', None, 43], [6, 'Alice', 9, 41], [4, 'Bob', 9, 36], [2, 'Winston', None, 37]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'reports_to', 'age']).astype({'employee_id':'Int64', 'name':'object', 'reports_to':'Int64', 'age':'Int64'})

In [3]:
employees

   employee_id     name  reports_to  age
0            9    Hercy        <NA>   43
1            6    Alice           9   41
2            4      Bob           9   36
3            2  Winston        <NA>   37

For this problem, we will consider a manager an employee who has at least 1 other employee reporting to them.

Write a solution to report the ids and the names of all managers, the number of employees who report directly to them, and the average age of the reports rounded to the nearest integer.

Return the result table ordered by employee_id.

The result format is in the following example.

| employee_id | name  | reports_count | average_age |
|-------------|-------|---------------|-------------|
| 9           | Hercy | 2             | 39          |

In [19]:
managers = employees.groupby('reports_to').agg(
    reports_count=('employee_id', 'count'),
    average_age=('age', 'mean')
).reset_index().rename(columns={"reports_to":"employee_id"})
managers["average_age"]=(managers["average_age"]+1e-7).round(0)
managers

   employee_id  reports_count  average_age
0            9              2         39.0

In [15]:
employees[["employee_id","name"]].merge(right=managers, on="employee_id", how="right")

   employee_id   name  reports_count  average_age
0            9  Hercy              2         38.5